from .search_seed import *
from .c_util import *
from .benchmark_util import *

planet_types_c = ["地中海", "冰巨星", "干旱荒漠", "灰烬冻土", "海洋丛林", "熔岩", "冰原冻土", "贫瘠荒漠", "戈壁",
                "火山灰", "红石", "草原", "水世界", "黑石盐滩", "樱林海", "飓风石林", "猩红冰湖", "热带草原",
                "橙晶荒漠", "极寒冻土", "潘多拉沼泽", "高产气巨", "气态巨星"]
star_types_c = ["红巨星", "黄巨星", "蓝巨星", "白巨星", "白矮星", "中子星", "黑洞",
              "A型恒星", "B型恒星", "F型恒星", "G型恒星", "K型恒星", "M型恒星", "O型恒星"]
vein_names_c = ["铁", "铜", "硅", "钛", "石", "煤", "油", "可燃冰", "金伯利", "分型硅", "有机晶体", "光栅石", "刺笋结晶", "单极磁石"]
